app/controllers/products_controller.rb

	def create
		product = Product.create(products_params)
---
INSERT INTO "products" ("name", "description", "pricing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "cup"], ["description", "cup description"], ["pricing", 5.0], ["created_at", "2016-07-20 17:44:16.005668"], ["updated_at", "2016-07-20 17:44:16.005668"]]

	def update
		product = Product.find(params[:id])
		product.update(products_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "laptop1"], ["updated_at", "2016-07-20 23:42:16.067019"], ["id", 3]]

	def destroy
		product = Product.find(params[:id])
		product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]